src/Catalogs/ТипыПроектов/ТипыПроектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТипыПроектов</name>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СоставТипа</name>
    <attributes>
      <name>ЭтапПроекта</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ПлановаяДлительность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИзмерениеДлительности</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>РольОтветственного</name>
      <type>
        <types>CatalogRef.РолиПользователей</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗависимостиЭтапов</name>
    <attributes>
      <name>Этап</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗависимыйЭтап</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РесурсноеОбеспечение</name>
    <attributes>
      <name>ЭтапПроекта</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Ресурс</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ВнешнееОбеспечение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Обеспечен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/ТипыПроектов/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПроставитьЗависимостиЭтапов()
	
	Для каждого СтрокаСоставаТипов Из Объект.СоставТипа Цикл
	   СтрокаСоставаТипов.ЭтапыПредшественники.Очистить();	
	КонецЦикла;
	
	Для каждого СтрокаЗависимостейЭтапов Из Объект.ЗависимостиЭтапов Цикл
		
		СтрокиЗависимыхЭтаповВСоставе = Объект.СоставТипа.НайтиСтроки(Новый Структура("ЭтапПроекта",СтрокаЗависимостейЭтапов.ЗависимыйЭтап));
		
		Для каждого НайденнаяСтрокаСостава Из СтрокиЗависимыхЭтаповВСоставе Цикл

			НайденнаяСтрокаСостава.ЭтапыПредшественники.Добавить(СтрокаЗависимостейЭтапов.Этап);
		
		КонецЦикла;
	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗависимостиЭтаповПриИзменении(Элемент)
	ПроставитьЗависимостиЭтапов();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПроставитьЗависимостиЭтапов();
КонецПроцедуры

&НаКлиенте
Процедура ЗависимостиЭтаповПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	Если НЕ ОтменаРедактирования Тогда
		
		МассивНайденныхСтрок = Объект.ЗависимостиЭтапов.НайтиСтроки(Новый Структура("Этап,ЗависимыйЭтап",Элемент.ТекущиеДанные.ЗависимыйЭтап,Элемент.ТекущиеДанные.Этап));
		
		Если МассивНайденныхСтрок.Количество() Тогда 
			Сообщить("Зацикливание этапов! Необходимо выбрать другой этап");
			Отказ=Истина;
		КонецЕсли;
		
	КонецЕсли;  // Если НЕ ОтменаРедактирования Тогда
	
КонецПроцедуры
